ERP.belugaerp/src/InformationRegisters/ДействиеСкидокНаценок/ДействиеСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДействиеСкидокНаценок</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Источник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>СкидкаНаценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/СпособыПримененияСкидокНаценок/СпособыПримененияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыПримененияСкидокНаценок</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>НачислитьБонусныеБаллы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрименитьВМоментРасчетаСкидокНаценок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/СпособыПредоставленияСкидокНаценок/СпособыПредоставленияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыПредоставленияСкидокНаценок</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Процент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок/ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>СписокНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>БезОграничений</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СегментНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеСегментНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтборКомпоновкиДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ИсточникиЦеновойГруппы/бг_ИсточникиЦеновойГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ИсточникиЦеновойГруппы</name>
  <enumValues>
    <name>SKU_MT</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>BrandMT</name>
  </enumValues>
  <enumValues>
    <name>BrandTM</name>
  </enumValues>
  <enumValues>
    <name>Вкус</name>
  </enumValues>
  <enumValues>
    <name>Класс</name>
  </enumValues>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>ЦеноваяГруппа</name>
  </enumValues>
  <enumValues>
    <name>Смешанный</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/СтатусыДействияСкидок/СтатусыДействияСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДействияСкидок</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеДействует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/СкидкиНаценки/СкидкиНаценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СкидкиНаценки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КорневаяГруппа</name>
    </items>
  </predefined>
  <attributes>
    <name>бг_Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Акционная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_БезусловноеПрименениеПослеПервогоСрабатывания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_БлокируетСуммовыеСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИсточникЦеновойГруппы</name>
    <type>
      <types>EnumRef.бг_ИсточникиЦеновойГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КаналыПродаж</name>
    <type>
      <types>CatalogRef.битКаналыПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодСтрокиБюджета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Накопительная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НеУчитыватьПороги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОграничениеСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипСкидкиНаценкиCRM</name>
    <type>
      <types>CatalogRef.бг_ТипыСкидокНаценокCRM</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТребуетсяПодтверждениеМТ</name>
    <comment>МТ - мобильная торговля</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ШаблонСкидкиЧКН</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСовместногоПрименения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>бг_ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
        <types>CatalogRef.бг_ЕК_СКЮ_СкюМТ</types>
        <types>CatalogRef.бг_ЕК_Бренды_БрендыТМ</types>
        <types>CatalogRef.бг_ЕК_Бренды_БрендыМТ</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.бг_ЕК_СКЮ_Вкусы</types>
        <types>CatalogRef.бг_ЕК_СКЮ_Классы</types>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бренд_МТ</name>
      <type>
        <types>CatalogRef.бг_ЕК_Бренды_БрендыМТ</types>
      </type>
    </attributes>
    <attributes>
      <name>Вкус</name>
      <type>
        <types>CatalogRef.бг_ЕК_СКЮ_Вкусы</types>
      </type>
    </attributes>
    <attributes>
      <name>СкюМТ</name>
      <type>
        <types>CatalogRef.бг_ЕК_СКЮ_СкюМТ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_Исключения</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
        <types>CatalogRef.битКаналыПродаж</types>
        <types>CatalogRef.битТерриторииПунктовНазначения</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.СегментыПартнеров</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_Ограничения</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоСуммеСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоОбъему</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоСуммеСкидкиНаПунктНазначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоОбъемуНаПунктНазначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/CommonModules/бг_СкидкиНаценкиИнтеграция/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ВыгрузкаДанных

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	Реквизиты = ВыгружаемыеРеквизиты();
	
	адаптер_НастройкиОбмена.УстановитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		Реквизиты);
	
	ДобавитьПроизвольныеРеквизитыКВыгрузке(РеквизитыИСвойства);
	
КонецПроцедуры

Функция ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения) Экспорт
	
	Перем адаптер_ОбработчикиСобытийСтандартный, адаптер_РаботаСДаннымиИБ;
	
	адаптер_ОбработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_ОбработчикиСобытийСтандартный");
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	ДанныеОбъекта = адаптер_ОбработчикиСобытийСтандартный.ПолучитьДанныеВыгружаемогоОбъекта(
						Объект, 
						ДанныеСообщения);
	
	Если ДанныеОбъекта.Реквизиты.Количество() > 0 Тогда
		
		РеквизитыОбъекта = ДанныеОбъекта.Реквизиты[0];
		
		ПараметрыВыполненияЗапросов = адаптер_РаботаСДаннымиИБ.ПолучитьПараметрыВыполненияЗапросов(
										Объект, 
										ДанныеСообщения);
		
		ЗаполнитьОтборы(
			РеквизитыОбъекта, 
			Объект, 
			ПараметрыВыполненияЗапросов, 
			ДанныеСообщения);
			
		ЗаполнитьПризнакСкидкаЧКН(
			РеквизитыОбъекта, 
			Объект);
		
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ВыполненыУсловияВыгрузкиОбъекта(ДанныеСообщения) Экспорт
	
	Результат = Истина;
	
	ДанныеОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСообщения.Объект, "ЭтоГруппа, Родитель");
	Если ДанныеОбъекта.ЭтоГруппа Тогда
		ТекстОшибки = НСтр("ru = 'Группы скидок не выгружаются'");
		ДанныеСообщения.ТекстОшибки = ТекстОшибки;
		Результат = Ложь;
	ИначеЕсли ДанныеОбъекта.Родитель <> бг_КонстантыПовтИсп.ЗначениеКонстанты("ГруппаСкидокЧКН") Тогда
		ТекстОшибки = НСтр("ru = 'Выгружаются только скидки из группы ЧКН'");
		ДанныеСообщения.ТекстОшибки = ТекстОшибки;
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДанных

Процедура ЗаполнитьЗагружаемыйОбъект(ЗагружаемыйОбъект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_ОбработчикиСобытийСтандартный;
	
	адаптер_ОбработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_ОбработчикиСобытийСтандартный");
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОбъекта.Вставить("Родитель", Справочники.СкидкиНаценки.КорневаяГруппа);
	Если СтруктураОбъекта.Свойство("Организация") Тогда
		СтруктураОбъекта.Вставить("бг_Организация", СтруктураОбъекта.Организация);
		СтруктураОбъекта.Удалить("Организация");
	КонецЕсли;
	Если СтруктураОбъекта.Свойство("КодСтроки") Тогда
		СтруктураОбъекта.Вставить("бг_КодСтрокиБюджета", СтруктураОбъекта.КодСтроки);
		СтруктураОбъекта.Удалить("КодСтроки");
	КонецЕсли;
	Если СтруктураОбъекта.Свойство("ТипСкидкиНаценки") Тогда
		СтруктураОбъекта.Вставить("бг_ТипСкидкиНаценкиCRM", СтруктураОбъекта.ТипСкидкиНаценки);
		СтруктураОбъекта.Удалить("ТипСкидкиНаценки");
	КонецЕсли;
	Если СтруктураОбъекта.Свойство("БлокироватьСуммовыеСкидки") Тогда
		СтруктураОбъекта.Вставить("бг_БлокируетСуммовыеСкидки", СтруктураОбъекта.БлокироватьСуммовыеСкидки);
		СтруктураОбъекта.Удалить("БлокироватьСуммовыеСкидки");
	КонецЕсли;
	
	ЗагружаемыйОбъект.бг_ЦеновыеГруппы.Очистить();
	ЗагружаемыйОбъект.бг_Исключения.Очистить();
	ЗагружаемыйОбъект.бг_Ограничения.Очистить();
		
	адаптер_ОбработчикиСобытийСтандартный.ЗаполнитьЗагружаемыйОбъект(
		ЗагружаемыйОбъект, 
		СтруктураОбъекта, 
		СписокСвойств, 
		ИсключаяСвойства);
		
	ЗагружаемыйОбъект.СпособПримененияСкидки = Перечисления.СпособыПримененияСкидокНаценок.ПрименитьВМоментРасчетаСкидокНаценок;
	ЗагружаемыйОбъект.бг_Комментарий = ЗагружаемыйОбъект.Наименование;
	ЗагружаемыйОбъект.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Процент;
	ЗагружаемыйОбъект.ВариантОтбораНоменклатуры = Перечисления.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.БезОграничений;

	ЗагружаемыйОбъект.бг_ИсточникЦеновойГруппы = Перечисления.бг_ИсточникиЦеновойГруппы.SKU_MT;
	
	ЗагружаемыйОбъект.ДополнительныеСвойства.Вставить("ПериодОтгрузкиНачало", СтруктураОбъекта.ПериодОтгрузкиНачало);
	ЗагружаемыйОбъект.ДополнительныеСвойства.Вставить("ПериодОтгрузкиКонец", СтруктураОбъекта.ПериодОтгрузкиКонец);
	
	ЗагружаемыйОбъект.ДополнительныеСвойства.Вставить("ПолучателиСкидок", ПолучателиСкидок(СтруктураОбъекта));
	
	ЗаполнитьЦеновыеГруппы(ЗагружаемыйОбъект, СтруктураОбъекта);
КонецПроцедуры

Процедура ЗаписатьЗагружаемыйОбъект(ЗагружаемыйОбъект, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_ОбработчикиСобытийСтандартный;
	адаптер_ОбработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_ОбработчикиСобытийСтандартный");
	
	СтандартнаяОбработка = Ложь;
	адаптер_ОбработчикиСобытийСтандартный.ЗаписатьЗагружаемыйОбъект(ЗагружаемыйОбъект);
	Справочники.адаптер_ИсходящиеСообщения.ЗарегистрироватьИсходящееСообщениеПриЗаписи(
		ЗагружаемыйОбъект,
		,
		,
		ЗагружаемыйОбъект);
		
	ЗаписатьДействиеСкидок(ЗагружаемыйОбъект.Ссылка, 
		ЗагружаемыйОбъект.ДополнительныеСвойства.ПолучателиСкидок, 
		ЗагружаемыйОбъект.ДополнительныеСвойства.ПериодОтгрузкиНачало, 
		ЗагружаемыйОбъект.ДополнительныеСвойства.ПериодОтгрузкиКонец);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()
	
	ВыгружаемыеРеквизиты = Новый Массив;
	
	ВыгружаемыеРеквизиты.Добавить("ЗначениеСкидкиНаценки");
	ВыгружаемыеРеквизиты.Добавить("Наименование");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("Предопределенный");
	
	Возврат ВыгружаемыеРеквизиты;
	
КонецФункции

Процедура ДобавитьПроизвольныеРеквизитыКВыгрузке(РеквизитыИСвойства)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"УсловияПоПроект.Проект",
		Новый ОписаниеТипов("СправочникСсылка.Проекты"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"УсловияПоБренд_МТ.Бренд_МТ",
		Новый ОписаниеТипов("СправочникСсылка.бг_ЕК_Бренды_БрендыМТ"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"УсловияПоСКЮ_МТ.СКЮ_МТ",
		Новый ОписаниеТипов("СправочникСсылка.бг_ЕК_СКЮ_СкюМТ"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"УсловияПоБренд_ТМ.Бренд_ТМ",
		Новый ОписаниеТипов("СправочникСсылка.бг_ЕК_Бренды_БрендыТМ"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"УсловияПоВкус.Вкус",
		Новый ОписаниеТипов("СправочникСсылка.бг_ЕК_СКЮ_Вкусы"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"УсловияПоКласс.Класс",
		Новый ОписаниеТипов("СправочникСсылка.бг_ЕК_СКЮ_Классы"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"УсловияПоНоменклатура.Номенклатура",
		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"ЭтоСкидкаЧКН",
		Новый ОписаниеТипов("Булево"));
		
КонецПроцедуры

Процедура ЗаполнитьОтборы(РеквизитыОбъекта, Объект, ПараметрыВыполненияЗапросов, ДанныеСообщения)
	
	Перем адаптер_РаботаСДаннымиИБ;
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	ОтборыКомпановкиДанных = ПолучитьДанныеОтбораКомпановкиДанных(Объект);
	Если ОтборыКомпановкиДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр(
		"Проекты", 
		ПолучитьДанныеОтбораПоТипу(ОтборыКомпановкиДанных, "УсловияПоПроект"));
		
	Запрос.УстановитьПараметр(
		"БрендыМТ", 
		ПолучитьДанныеОтбораПоТипу(ОтборыКомпановкиДанных, "УсловияПоБренд_МТ"));
		
	Запрос.УстановитьПараметр(
		"БрендыТМ",
		ПолучитьДанныеОтбораПоТипу(ОтборыКомпановкиДанных, "УсловияПоБренд_ТМ"));
		
	Запрос.УстановитьПараметр(
		"СкюМТ", 
		ПолучитьДанныеОтбораПоТипу(ОтборыКомпановкиДанных, "УсловияПоСКЮ_МТ"));
		
	Запрос.УстановитьПараметр(
		"Классы", 
		ПолучитьДанныеОтбораПоТипу(ОтборыКомпановкиДанных, "УсловияПоКласс"));
		
	Запрос.УстановитьПараметр(
		"Вкусы",
		ПолучитьДанныеОтбораПоТипу(ОтборыКомпановкиДанных, "УсловияПоВкус"));
		
	Запрос.УстановитьПараметр(
		"Номенклатура",
		ПолучитьДанныеОтбораПоТипу(ОтборыКомпановкиДанных, "УсловияПоНоменклатура"));
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Проекты.Ссылка КАК Проект_ЗначениеРеквизитаИдентификатор,
	|	Проекты.Ссылка КАК Проект_ЗначениеРеквизитаТаблицаКлючей,
	|	Проекты.Код КАК Проект_ЗначениеРеквизитаКод
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	Проекты.Ссылка В(&Проекты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бг_ЕК_Бренды_БрендыМТ.Ссылка КАК Бренд_МТ_ЗначениеРеквизитаИдентификатор,
	|	бг_ЕК_Бренды_БрендыМТ.Ссылка КАК Бренд_МТ_ЗначениеРеквизитаТаблицаКлючей,
	|	бг_ЕК_Бренды_БрендыМТ.Код КАК Бренд_МТ_ЗначениеРеквизитаКод
	|ИЗ
	|	Справочник.бг_ЕК_Бренды_БрендыМТ КАК бг_ЕК_Бренды_БрендыМТ
	|ГДЕ
	|	бг_ЕК_Бренды_БрендыМТ.Ссылка В(&БрендыМТ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бг_ЕК_Бренды_БрендыТМ.Ссылка КАК Бренд_ТМ_ЗначениеРеквизитаИдентификатор,
	|	бг_ЕК_Бренды_БрендыТМ.Ссылка КАК Бренд_ТМ_ЗначениеРеквизитаТаблицаКлючей,
	|	бг_ЕК_Бренды_БрендыТМ.Код КАК Бренд_ТМ_ЗначениеРеквизитаКод
	|ИЗ
	|	Справочник.бг_ЕК_Бренды_БрендыТМ КАК бг_ЕК_Бренды_БрендыТМ
	|ГДЕ
	|	бг_ЕК_Бренды_БрендыТМ.Ссылка В(&БрендыТМ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бг_ЕК_СКЮ_СкюМТ.Ссылка КАК СкюМТ_ЗначениеРеквизитаИдентификатор,
	|	бг_ЕК_СКЮ_СкюМТ.Ссылка КАК СкюМТ_ЗначениеРеквизитаТаблицаКлючей,
	|	бг_ЕК_СКЮ_СкюМТ.Код КАК СкюМТ_ЗначениеРеквизитКод
	|ИЗ
	|	Справочник.бг_ЕК_СКЮ_СкюМТ КАК бг_ЕК_СКЮ_СкюМТ
	|ГДЕ
	|	бг_ЕК_СКЮ_СкюМТ.Ссылка В(&СкюМТ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бг_ЕК_СКЮ_Классы.Ссылка КАК Класс_ЗначениеРеквизитаИдентификатор,
	|	бг_ЕК_СКЮ_Классы.Ссылка КАК Класс_ЗначениеРеквизитаТаблицаКлючей,
	|	бг_ЕК_СКЮ_Классы.Код КАК Класс_ЗначениеРеквизитаКод
	|ИЗ
	|	Справочник.бг_ЕК_СКЮ_Классы КАК бг_ЕК_СКЮ_Классы
	|ГДЕ
	|	бг_ЕК_СКЮ_Классы.Ссылка В(&Классы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бг_ЕК_СКЮ_Вкусы.Ссылка КАК Вкус_ЗначениеРеквизитаИдентификатор,
	|	бг_ЕК_СКЮ_Вкусы.Ссылка КАК Вкус_ЗначениеРеквизитаТаблицаКлючей,
	|	бг_ЕК_СКЮ_Вкусы.Код КАК Вкус_ЗначениеРеквизитаКод
	|ИЗ
	|	Справочник.бг_ЕК_СКЮ_Вкусы КАК бг_ЕК_СКЮ_Вкусы
	|ГДЕ
	|	бг_ЕК_СКЮ_Вкусы.Ссылка В(&Вкусы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура_ЗначениеРеквизитаИдентификатор,
	|	Номенклатура.Ссылка КАК Номенклатура_ЗначениеРеквизитаТаблицаКлючей,
	|	Номенклатура.Код КАК Номенклатура_ЗначениеРеквизитаКод
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&Номенклатура)";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Проекты = адаптер_РаботаСДаннымиИБ.РезультатЗапросаВСтруктуруРеквизитов(
				МассивРезультатов[0],
				ПараметрыВыполненияЗапросов.ТаблицаКлючей,
				ДанныеСообщения);
		
	РеквизитыОбъекта.Вставить("УсловияПоПроект", Проекты);
	
	БрендыМТ = адаптер_РаботаСДаннымиИБ.РезультатЗапросаВСтруктуруРеквизитов(
				МассивРезультатов[1],
				ПараметрыВыполненияЗапросов.ТаблицаКлючей,
				ДанныеСообщения);
		
	РеквизитыОбъекта.Вставить("УсловияПоБренд_МТ", БрендыМТ);
	
	БрендыТМ = адаптер_РаботаСДаннымиИБ.РезультатЗапросаВСтруктуруРеквизитов(
				МассивРезультатов[2],
				ПараметрыВыполненияЗапросов.ТаблицаКлючей,
				ДанныеСообщения);
		
	РеквизитыОбъекта.Вставить("УсловияПоБренд_ТМ", БрендыТМ);
	
	СкюМТ = адаптер_РаботаСДаннымиИБ.РезультатЗапросаВСтруктуруРеквизитов(
				МассивРезультатов[3],
				ПараметрыВыполненияЗапросов.ТаблицаКлючей,
				ДанныеСообщения);
		
	РеквизитыОбъекта.Вставить("УсловияПоСКЮ_МТ", СкюМТ);
	
	Классы = адаптер_РаботаСДаннымиИБ.РезультатЗапросаВСтруктуруРеквизитов(
				МассивРезультатов[4],
				ПараметрыВыполненияЗапросов.ТаблицаКлючей,
				ДанныеСообщения);
		
	РеквизитыОбъекта.Вставить("УсловияПоКласс", Классы);
	
	Вкусы = адаптер_РаботаСДаннымиИБ.РезультатЗапросаВСтруктуруРеквизитов(
				МассивРезультатов[5],
				ПараметрыВыполненияЗапросов.ТаблицаКлючей,
				ДанныеСообщения);
		
	РеквизитыОбъекта.Вставить("УсловияПоВкус", Вкусы);
	
	Номенклатура = адаптер_РаботаСДаннымиИБ.РезультатЗапросаВСтруктуруРеквизитов(
					МассивРезультатов[6],
					ПараметрыВыполненияЗапросов.ТаблицаКлючей,
					ДанныеСообщения);
		
	РеквизитыОбъекта.Вставить("УсловияПоНоменклатура", Номенклатура);
	
КонецПроцедуры

Функция ПолучитьДанныеОтбораКомпановкиДанных(Объект)
	
	СоотстветствиеТипов = ПолучитьСоответствиеТиповДанныхТЧ();
	
	ОтборыКомпановкиДанных = Новый Соответствие;
	
	НастройкиКомпановки = Объект.ХранилищеНастроекКомпоновкиДанных.Получить();
	Если НастройкиКомпановки <> Неопределено 
		И ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(НастройкиКомпановки, "ОтборПоНоменклатуре") Тогда
		
		ЭлементыОтбора = НастройкиКомпановки.ОтборПоНоменклатуре.Отбор.Элементы;
		
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			
			ДанныеОтбора = Новый Структура;
			ЗначениеОтбора = ЭлементОтбора.ПравоеЗначение;
			
			Если ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") Тогда
				МассивЭлементовОтбора = ЭлементОтбора.ПравоеЗначение.ВыгрузитьЗначения();
			Иначе
				МассивЭлементовОтбора = Новый Массив;
				МассивЭлементовОтбора.Добавить(ЭлементОтбора.ПравоеЗначение);
			КонецЕсли;
			
			ИмяТаблицыОтбора = СоотстветствиеТипов.Получить(ТипЗнч(МассивЭлементовОтбора[0]));
			
			Если ИмяТаблицыОтбора <> Неопределено Тогда
				ДанныеОтбора.Вставить(ИмяТаблицыОтбора, МассивЭлементовОтбора);
				ОтборыКомпановкиДанных.Вставить(ИмяТаблицыОтбора, ДанныеОтбора);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ОтборыКомпановкиДанных;
	
КонецФункции

Функция ПолучитьСоответствиеТиповДанныхТЧ()
	
	СоответствиеТипов = Новый Соответствие;
	
	СоответствиеТипов.Вставить(Тип("СправочникСсылка.Проекты"), "УсловияПоПроект");
	СоответствиеТипов.Вставить(Тип("СправочникСсылка.бг_ЕК_Бренды_БрендыМТ"), "УсловияПоБренд_МТ");
	СоответствиеТипов.Вставить(Тип("СправочникСсылка.бг_ЕК_СКЮ_СкюМТ"), "УсловияПоСКЮ_МТ");
	СоответствиеТипов.Вставить(Тип("СправочникСсылка.бг_ЕК_Бренды_БрендыТМ"), "УсловияПоБренд_ТМ");
	СоответствиеТипов.Вставить(Тип("СправочникСсылка.бг_ЕК_СКЮ_Вкусы"), "УсловияПоВкус");
	СоответствиеТипов.Вставить(Тип("СправочникСсылка.бг_ЕК_СКЮ_Классы"), "УсловияПоКласс");
	СоответствиеТипов.Вставить(Тип("СправочникСсылка.Номенклатура"), "УсловияПоНоменклатура");
	
	Возврат СоответствиеТипов;
	
КонецФункции

Функция ПолучитьДанныеОтбораПоТипу(ОтборыКомпановкиДанных, ИмяТаблицы)
	
	ЭлементыОтбора = Новый Массив;
	
	ДанныеОтбора = ОтборыКомпановкиДанных.Получить(ИмяТаблицы);
	Если ДанныеОтбора <> Неопределено Тогда
		ЭлементыОтбора = ДанныеОтбора[ИмяТаблицы];
	КонецЕсли;
	
	Возврат ЭлементыОтбора;
	
КонецФункции

Процедура ЗаполнитьПризнакСкидкаЧКН(РеквизитыОбъекта, Объект)
	
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Родитель");
	Если Родитель = бг_КонстантыПовтИсп.ЗначениеКонстанты("ГруппаСкидокЧКН") Тогда
		РеквизитыОбъекта.Вставить("ЭтоСкидкаЧКН", Истина);
	Иначе
		РеквизитыОбъекта.Вставить("ЭтоСкидкаЧКН", Ложь);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучателиСкидок(СтруктураОбъекта)

	ЕстьТерритория = Ложь;
	ЕстьКаналСбыта = Ложь;
	
	ПолучателиСкидок = Новый Массив;
	Если СтруктураОбъекта.Свойство("ПолучателиСкидок") Тогда
		Для каждого СтрокаПолучателиСкидок Из СтруктураОбъекта.ПолучателиСкидок Цикл
			Если СтрокаПолучателиСкидок.Свойство("Контрагент")
				И ЗначениеЗаполнено(СтрокаПолучателиСкидок.Контрагент) Тогда
				ПолучателиСкидок.Добавить(СтрокаПолучателиСкидок.Контрагент);
			КонецЕсли;
			Если СтрокаПолучателиСкидок.Свойство("Территория")
				И ЗначениеЗаполнено(СтрокаПолучателиСкидок.Территория) Тогда
				ПолучателиСкидок.Добавить(СтрокаПолучателиСкидок.Территория);
				ЕстьТерритория = Истина;
			КонецЕсли;
			Если СтрокаПолучателиСкидок.Свойство("КаналСбыта")
				И ЗначениеЗаполнено(СтрокаПолучателиСкидок.КаналСбыта) Тогда
				ПолучателиСкидок.Добавить(СтрокаПолучателиСкидок.КаналСбыта);
				ЕстьКаналСбыта = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьТерритория = Ложь
		И СтруктураОбъекта.Свойство("Территория") Тогда
		ПолучателиСкидок.Добавить(СтруктураОбъекта.Территория);
	КонецЕсли;
	Если ЕстьКаналСбыта = Ложь
		И СтруктураОбъекта.Свойство("КаналПродаж") Тогда
		ПолучателиСкидок.Добавить(СтруктураОбъекта.КаналПродаж);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПолучателиСкидок) Тогда
		Возврат ПолучателиСкидок;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В(&ПолучателиСкидок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КаналыПродаж.Ссылка
	|ИЗ
	|	Справочник.битКаналыПродаж КАК КаналыПродаж
	|ГДЕ
	|	КаналыПродаж.Ссылка В(&ПолучателиСкидок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТерриторииПунктовНазначения.Ссылка
	|ИЗ
	|	Справочник.битТерриторииПунктовНазначения КАК ТерриторииПунктовНазначения
	|ГДЕ
	|	ТерриторииПунктовНазначения.Ссылка В(&ПолучателиСкидок)";
	
	Запрос.УстановитьПараметр("ПолучателиСкидок", ПолучателиСкидок);
	
	ПолучателиСкидок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");;
	
	Возврат ПолучателиСкидок;

КонецФункции

Процедура ЗаполнитьЦеновыеГруппы(ЗагружаемыйОбъект, СтруктураОбъекта)

	Если Не СтруктураОбъекта.Свойство("РасшифровкаБрендов") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаРасшифровкаБрендов Из СтруктураОбъекта.РасшифровкаБрендов Цикл
		ЗаполненБренд = ЗначениеЗаполнено(СтрокаРасшифровкаБрендов.Бренд);
		
		Если ЗаполненБренд
			Или ЗначениеЗаполнено(СтрокаРасшифровкаБрендов.СКЮ_МТ) Тогда
			СтрокаЦеноваяГруппа = ЗагружаемыйОбъект.бг_ЦеновыеГруппы.Добавить();
			СтрокаЦеноваяГруппа.ЗначениеСкидкиНаценки = СтрокаРасшифровкаБрендов.ПроцентСкидкиНаценки;
			Если ЗаполненБренд Тогда
				ЗагружаемыйОбъект.бг_ИсточникЦеновойГруппы = Перечисления.бг_ИсточникиЦеновойГруппы.Смешанный;
			КонецЕсли;
			
			Если ЗагружаемыйОбъект.бг_ИсточникЦеновойГруппы = Перечисления.бг_ИсточникиЦеновойГруппы.Смешанный Тогда
				СтрокаЦеноваяГруппа.ЦеноваяГруппа = СтрокаРасшифровкаБрендов.Бренд;
				СтрокаЦеноваяГруппа.Бренд_МТ = СтрокаРасшифровкаБрендов.БрендМТ;
				СтрокаЦеноваяГруппа.Вкус = СтрокаРасшифровкаБрендов.ВкусМТ;
				СтрокаЦеноваяГруппа.СкюМТ = СтрокаРасшифровкаБрендов.СКЮ_МТ;
			Иначе
				СтрокаЦеноваяГруппа.ЦеноваяГруппа = СтрокаРасшифровкаБрендов.СКЮ_МТ;
			КонецЕсли;
			
		Иначе
			ЗагружаемыйОбъект.ЗначениеСкидкиНаценки = СтрокаРасшифровкаБрендов.ПроцентСкидкиНаценки;
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры


Процедура ЗаписатьДействиеСкидок(СкидкаНаценка, Знач ИсточникиДействияСкидок, 
	ДатаНачалаДействияСхемы = Неопределено, ДатаОкончанияДействияСхемы = Неопределено)

	Если Не ЗначениеЗаполнено(ИсточникиДействияСкидок) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ИсточникиДействияСкидок) <> Тип("Массив") Тогда
		ИсточникиДействияСкидокКопия = ИсточникиДействияСкидок;
		ИсточникиДействияСкидок = Новый Массив;
		ИсточникиДействияСкидок.Добавить(ИсточникиДействияСкидокКопия);
	КонецЕсли;
	
	Для каждого Источник Из ИсточникиДействияСкидок Цикл
		НаборЗаписей = РегистрыСведений.ДействиеСкидокНаценок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Источник.Установить(Источник);
		НаборЗаписей.Отбор.СкидкаНаценка.Установить(СкидкаНаценка);
		Если ЗначениеЗаполнено(ДатаНачалаДействияСхемы) Тогда

			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = ДатаНачалаДействияСхемы;
			НоваяЗапись.Источник = Источник;
			НоваяЗапись.СкидкаНаценка = СкидкаНаценка;
			
			НоваяЗапись.Статус = Перечисления.СтатусыДействияСкидок.Действует;
			НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаОкончанияДействияСхемы) Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = ДатаОкончанияДействияСхемы;
			НоваяЗапись.Источник = Источник;
			НоваяЗапись.СкидкаНаценка = СкидкаНаценка;
			
			НоваяЗапись.Статус = Перечисления.СтатусыДействияСкидок.НеДействует;
			НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
			
		КонецЕсли;
		
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
